app/views/users/show.html.erb

    <% count = 0 %>
    <% Album.where(user_id: @user.id).find_each do |a| %>
---
SELECT  "albums".* FROM "albums" WHERE "albums"."user_id" = ? ORDER BY "albums"."id" ASC LIMIT ?  [["user_id", 1], ["LIMIT", 1000]]