app/views/shared/_sidebar.html.erb

SELECT "users".* FROM "users"
---

        <% User.all.each do |u| %>