app/views/shared/_topnav.html.erb

          <ul class="dropdown-menu">
            <% User.all.each do |u| %>
---
SELECT "users".* FROM "users"