app/views/pieces/_form.html.erb

SELECT  "albums".* FROM "albums" ORDER BY "albums"."id" ASC LIMIT ?  [["LIMIT", 1000]]
---
  <!-- Only allow adding to the current users albums  -->
  <% Album.find_each { |a| if a.user_id == current_user.id then array << [a.title, a.id] end} %>