app/views/pieces/index.html.erb

<% Piece.find_each do |a| %>
---
SELECT  "pieces".* FROM "pieces" ORDER BY "pieces"."id" ASC LIMIT ?  [["LIMIT", 1000]]

      <h2><%= link_to a.title, edit_piece_path(a.id) %></h2>
      <p><%= "(User: " + User.find_by_id(a.user_id).email + ")" %></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]