app/views/albums/index.html.erb

SELECT  "albums".* FROM "albums" ORDER BY "albums"."id" ASC LIMIT ?  [["LIMIT", 1000]]
---
<% Album.find_each do |a| %>