app/views/albums/show.html.erb

  <% count = 0 %>
  <% Piece.where(album_id: @album.id).in_groups_of(4, false) do |group| %>
---
SELECT "pieces".* FROM "pieces" WHERE "pieces"."album_id" = ?  [["album_id", 1]]