app/controllers/albums_controller.rb

  def create
    @album = current_user.albums.build(permit_album)
    if @album.save
---
INSERT INTO "albums" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Tom's First Album"], ["description", "The newest and greatest"], ["user_id", 1], ["created_at", 2016-07-22 21:37:36 UTC], ["updated_at", 2016-07-22 21:37:36 UTC]]

  def show
    @user = User.find_by_id(@album.user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    if @album.update(permit_album)
---
UPDATE "albums" SET "title" = ?, "description" = ?, "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "albums"."id" = ?

  def destroy
    uid = @album.user_id
    @album.destroy
---
DELETE FROM "albums" WHERE "albums"."id" = ?  [["id", 2]]

    def find_album
      @album = Album.find(params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]