app/controllers/pieces_controller.rb

  def create
    @piece = Piece.new(permit_piece)

    if params[:p_id]
      @piece.album_id = params[:p_id]
    end

    if @piece.save
---
INSERT INTO "pieces" ("title", "description", "created_at", "updated_at", "album_id") VALUES (?, ?, ?, ?, ?)  [["title", "Beach"], ["description", ""], ["created_at", 2016-08-05 21:50:06 UTC], ["updated_at", 2016-08-05 21:50:06 UTC], ["album_id", 2]]

  def show
    @piece_owner = User.find_by_id(Album.find_by_id(@piece.album_id).user_id)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    if @piece.update(permit_piece)
---
UPDATE "pieces" SET "title" = ?, "updated_at" = ? WHERE "pieces"."id" = ?  [["title", "Cooking in the kitchen"], ["updated_at", 2016-07-23 03:06:11 UTC], ["id", 3]]

  def destroy
    album_id = @piece.album_id
    piece_name = @piece.title
    @piece.destroy
---
DELETE FROM "pieces" WHERE "pieces"."id" = ?  [["id", 1]]

    def find_piece
      @piece = Piece.find(params[:id])
---
SELECT  "pieces".* FROM "pieces" WHERE "pieces"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]