app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "albums".* FROM "albums" WHERE "albums"."user_id" = ?  [["user_id", 2]]
---
  def show
    @user = User.find(params[:id])
    @edit_mode = user_signed_in? && (current_user.id == @user.id)
    @user_albums = Album.where(user_id: @user.id)